#+STARTIP: overview
* Lisp Mode
  #+BEGIN_SRC emacs-lisp
    (use-package racket-mode
      :ensure t
      :hook (racket-mode . racket-xp-mode))

    (use-package rainbow-delimiters
      :ensure t
      :hook
      ((emacs-lisp-mode . rainbow-delimiters-mode)
       (racket-mode . rainbow-delimiters-mode)
       (racket-repl-mode . rainbow-delimiters-mode)))

    (use-package paredit
      :ensure t
      :hook
      ((emacs-lisp-mode . paredit-mode)
       (racket-mode . paredit-mode)
       (racket-repl-mode . paredit-mode)))
  #+END_SRC

  #+RESULTS:
  | paredit-mode | rainbow-delimiters-mode |

